In [10]:
import pandas as pd
from database_script import my_conn
from sqlalchemy import create_engine
from sqlalchemy import text
from sqlalchemy.exc import SQLAlchemyError

df  = pd.read_csv("C:/Users/Admin/Downloads/csv_format.csv")

In [11]:
df.head()

,Artist,Title,Year,Sales,Streams,Downloads,Radio Plays,Rating
0,Bill Haley & his Comets,Rock Around the Clock,1955,36.503,19.961,7.458,5.663,0.760
1,Celine Dion,My Heart Will Go On,1998,35.405,12.636,8.944,23.701,3.610
2,Sinead O'Connor,Nothing Compares 2 U,1990,35.135,14.582,10.242,23.747,2.733
3,The Beatles,Hey Jude,1968,34.442,25.545,16.390,16.541,1.510
4,Bryan Adams,(Everything I Do) I Do it For You,1991,34.367,16.523,12.368,23.194,3.121

In [27]:
df.to_sql(con = my_conn, name = 'artist', if_exists='append')

4850

In [28]:
result = my_conn.execute(text("SELECT count(*) FROM artist"))
columns = [] 
  
for elem in result.cursor.description: 
    columns.append(elem[0]) 
print(result.all())

[(14550,)]

In [25]:
print(columns)

['index', 'Artist', 'Title', 'Year', 'Sales', 'Streams', 'Downloads', 'Radio Plays', 'Rating']